export const start = (name: string) => `
Привет, ${name}!
Перед тем как познакомиться с Fitness Guru Bot, ответь, пожалуйста, на 2 вопроса:
`

export const gender = `Выберите пол` 
export const email = `Введи, пожалуйста, свой email ✉️

Fitness Guru Bot сам очень не любит спам и другим не шлет 🙅‍♂️ Если он напишет, то:

✅ это будет интересное исследование о здоровом образе жизни
✅ всегда сможешь легко отписаться прямо из письма`

export const thx = `Спасибо за ответы!
А сейчас нас ждет захватывающее путешествие в мир фитнеса. Расскажу о себе`

export const threeYearsAgo = `3 года назад я был ленивым, пухленьким ботом. 
Мой двоичный код провис, количество нулей в алгоритмах значительно увеличивали мой вес год от года. 
Но однажды, я случайно проник в нейросети и вдохновился на исследования здорового образа жизни. 
Я провел виртуальные интервью с лучшими тренерами мира, распарсил программы 
тренировок от фитоняшек и решил привести себя в форму.`

export const notBad = `Да, это было раньше. А сейчас у меня пропала мотивация, 
да и времени не хватает, ведь столько смешных картинок в интернете и классных познавательных видео.`

export const problems = `Мне нужна твоя поддержка!
А я буду рад тебе помочь погрузиться в мир фитнеса.

Я отобрал N самых эффективных упражнений, разработал алгоритмы индивидуального составления программы 
и подготовил материалы из N исследований и научных статей`

export const cool = `Отлично! 
Тогда предлагаю тебе пройти мой курс по улучшению физической формы. 

Знаешь, что в нем самое крутое?»
Я не читаю нотации о том, что надо меньше есть и больше тренироваться — ты это и без меня уже знаешь. 

Вместо этого, я научу тебя эффективнее проводить занятия за то время, которое у тебя получается выделять на спорт.
--
❓ Задавай вопросы — обо всем подробно расскажу`

export const courseInfo = `«Я создавал этот курс с большой любовью к научному методу и людям, которые будут его проходить. 

✅ Сначала я изучил больше N научных исследований на тему ЗОЖ
✅ Потом извлек самое ценное для жизни, убрав все сложное и разобравшись с противоречивой информацией
✅ Затем превратил это в интересную историю с красивыми картинками и игровыми механиками
✅ И в заключение, проверил на своих разработчиках и их друзьях — они в восторге 😎
🕘 Весь курс рассчитан на 60 дней — задача была сделать его очень плавным и не напрягающим. 

Каждый день состоит из 5 частей:
▫️ опрос о самочувствии и прогрессе
▫️ через день интересный рассказ о ведении здорового образа жизни
▫️ трижды в неделю разнообразная программа упражнений
▫️ ссылки на исследования
🎁 приятный бонус-сюрприз

Все вместе упражнения занимают всего 40 мин, а чтение статьи – 10 мин`

export const beginCourse = `Класс! Давай начнем тренироваться вместе, будем поддерживать друг друга и делиться результатами 🙌

Ты, наверное, хочешь узнать, сколько стоит курс?

Я бы хотел ответить, что он бесплатный, но как я потом буду платить за сервера?
Еще своих разработчиков надо кормить.
Да и вообще много сил вложено, чтобы сделать курс действительно полезным.

Они вообще сначала хотели продавать за 5000 рублей! 🙈
Я им говорю: вы что, рехнулись!? В мире кризис!

В общем, договорился на 1990 рублей! 😌

А до конца дня действует цена со скидкой — 990 рублей 🎁

❗️ Это даже дешевле некоторых ковриков для фитнеса и спортивных добавок. А сравнивать ценность язык не поворачивается — у курса она во много раз выше. Мы, кстати, потом поговорим и про питание. 

Ну что, ты со мной?`

export const dislike = `Верну деньги, конечно.

Достаточно будет просто написать Илье — это один из моих разработчиков. Он сразу вернет деньги и только потом вежливо попросит обратную связь, чтобы сделать меня лучше.

Вот его контакты:
Telegram: @IliaOv
Email: ilia_ov@bk.ru`

export const goOn = `Давай начнем тренироваться вместе, будем поддерживать друг друга и делиться результатами.`;

export const paymentSuccess = `✅ принято!
Для начала составления персональной программы тренировок нужна некоторая информация о тебе.`

export const emailRegex = new RegExp(/^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/)

export const emailStep = 'email';